app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "qrgeg"], ["details", "ergerg"], ["created_at", "2020-06-21 15:36:55.896875"], ["updated_at", "2020-06-21 15:36:55.896875"]]
---
  def create
  	@task = Task.new(task_params)
  	@task.save